export default {
    data() {
        return {
            lottery: [
                {
                    name: 'CQSSC',
                    id: 11023,
                    list: [
                        {
                            name: '五星',
                            playType: {
                                '直选': [
                                    {
                                        name: '直选复式',
                                        tip: '从万位、千位、百位、十位、个位中选择一个5位数号码为一注，投注号码与开奖号码按位一致，即为中奖。',
                                        ball:
                                            {
                                                '万位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '个位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '直选单式',
                                        tip: '手动输入一个5位数号码组成一注，所选号码与开奖号码的万位、千位、百位、十位、个位相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '组选120',
                                        tip: '从0-9中任意选择5个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位、个位相同，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组选120': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选60',
                                        tip: '选择1个二重号码和3个单号号码组成一注，所选的单号号码与开奖号码相同，且所选二重号码在开奖号码中出现了2次，即为中奖。',
                                        ball:
                                            {
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选30',
                                        tip: '选择2个二重号和1个单号号码为一注（五个数字中，两对数字两两相同，剩余一个数字不同），投注号码与开奖号码全部相符，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选20',
                                        tip: '选择1个三重号码和2个单号号码为一注（五个数字中，三个数字相同，其他两个数字均不同），投注号码与开奖号码全部相符，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '三重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选10',
                                        tip: '选择1个三重号码和1个二重号码为一注（五个数字中，三个数字相同，其他两个数字相同），投注号码与开奖号码全部相符，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '三重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选5',
                                        tip: '选择1个三重号码和1个二重号码为一注（五个数字中，三个数字相同，其他两个数字相同），投注号码与开奖号码全部相符，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '四重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                ]
                            }
                        },
                        {
                            name: '前四',
                            playType: {
                                '直选': [
                                    {
                                        name: '直选复式',
                                        tip: '从万位、千位、百位、十位、个位中选择一个5位数号码为一注，投注号码与开奖号码按位一致，即为中奖。',
                                        ball:
                                            {
                                                '万位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '直选单式',
                                        tip: '手动输入一个4位数号码组成一注，所选号码的万位,千位,百位,十位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '组选24',
                                        tip: '从0-9中任意选择4个号码组成一注，所选号码与开奖号码的万位,千位,百位,十位相同，且顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组选24': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选12',
                                        tip: '选择1个二重号码和2个单号号码组成一注，所选号码与开奖号码的万位,千位,百位,十位相同，且所选二重号码在开奖号码千位、百位、十位、个位中出现了2次，即为中奖。',
                                        ball:
                                            {
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选6',
                                        tip: '选择2个二重号码组成一注，所选的2个二重号码在开奖号码万位,千位,百位,十位分别出现了2次，即为中奖。',
                                        ball:
                                            {
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选4',
                                        tip: '选择1个三重号码和1个单号号码组成一注，所选号码与开奖号码的万位,千位,百位,十位相同，且所选三重号码在开奖号码千位、百位、十位、个位中出现了3次，即为中奖。',
                                        ball:
                                            {
                                                '三重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '后四',
                            playType: {
                                '直选': [
                                    {
                                        name: '直选复式',
                                        tip: '从千位、百位、十位、个位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。',
                                        ball:
                                            {
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '个位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '直选单式',
                                        tip: '手动输入一个4位数号码组成一注，所选号码的万位,千位,百位,十位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '组选24',
                                        tip: '从0-9中任意选择4个号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组选24': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选12',
                                        tip: '选择1个二重号码和2个单号号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且所选二重号码在开奖号码千位、百位、十位、个位中出现了2次，即为中奖。',
                                        ball:
                                            {
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选6',
                                        tip: '选择2个二重号码组成一注，所选的2个二重号码在开奖号码千位、百位、十位、个位分别出现了2次，即为中奖。',
                                        ball:
                                            {
                                                '二重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组选4',
                                        tip: '选择1个三重号码和1个单号号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且所选三重号码在开奖号码千位、百位、十位、个位中出现了3次，即为中奖。',
                                        ball:
                                            {
                                                '三重号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '单号': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '前三',
                            playType: {
                                '直选': [
                                    {
                                        name: '直选复式',
                                        tip: '从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码的前3位相同，且顺序一致，即为中奖。',
                                        ball:
                                            {
                                                '万位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '直选单式',
                                        tip: '手动输入一个3位数号码组成一注，所选号码的万位、千位、百位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '组三',
                                        tip: '从0-9中选择2个数字组成两注，所选号码与开奖号码的万位、千位、百位相同，且顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组三': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组六',
                                        tip: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组六': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '混合组选',
                                        tip: '手动输入一个3位数号码组成一注（不含豹子号），开奖号码的万位、千位、十位符合后三组三或者组六均为中奖。',
                                        ball: false
                                    }
                                ],
                                '其他': [
                                    {
                                        name: '和值尾数',
                                        tip: '所选数值等于开奖号码的万位，千位，百位三个数字相加之和的尾数，即为中奖。',
                                        ball:
                                            {
                                                '尾数': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '豹子',
                                        tip: '开奖号码前三位：111,222,999等，只要前三位号码一致即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['豹子']
                                            }

                                    },
                                    {
                                        name: '顺子',
                                        tip: '开奖号码前三位：123,213,321等（顺序不限），即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['顺子']
                                            }

                                    },
                                    {
                                        name: '对子',
                                        tip: '开奖号码前三位：110，101,011等，只要前三位号码中任意两个数字相同即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['对子']
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '中三',
                            playType: {
                                '直选': [
                                    {
                                        name: '直选复式',
                                        tip: '从千位、百位、十位中选择一个3位数号码组成一注，所选号码与开奖号码的中间3位相同，且顺序一致，即为中奖。',
                                        ball:
                                            {
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '直选单式',
                                        tip: '手动输入一个3位数号码组成一注，所选号码的千位、百位、十位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '组三',
                                        tip: '从0-9中选择2个数字组成两注，所选号码与开奖号码的千位、百位、十位相同，且顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组三': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组六',
                                        tip: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组六': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '混合组选',
                                        tip: '动输入一个3位数号码组成一注（不含豹子号），开奖号码的千位、百位、十位符合中三组三或者组六均为中奖。',
                                        ball: false
                                    }
                                ],
                                '其他': [
                                    {
                                        name: '和值尾数',
                                        tip: '所选数值等于开奖号码的千位，百位，十位三个数字相加之和的尾数，即为中奖。',
                                        ball:
                                            {
                                                '尾数': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '豹子',
                                        tip: '开奖号码前三位：111,222,999等，只要前三位号码一致即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['豹子']
                                            }

                                    },
                                    {
                                        name: '顺子',
                                        tip: '开奖号码前三位：123,213,321等（顺序不限），即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['顺子']
                                            }

                                    },
                                    {
                                        name: '对子',
                                        tip: '开奖号码前三位：110，101,011等，只要前三位号码中任意两个数字相同即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['对子']
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '后三',
                            playType: {
                                '直选': [
                                    {
                                        name: '直选复式',
                                        tip: '从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码后3位相同，且顺序一致，即为中奖。',
                                        ball:
                                            {
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '个位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '直选单式',
                                        tip: '手动输入一个3位数号码组成一注，所选号码的百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '组三',
                                        tip: '从0-9中选择2个数字组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组三': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '组六',
                                        tip: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。',
                                        ball:
                                            {
                                                '组六': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '混合组选',
                                        tip: '手动输入一个3位数号码组成一注（不含豹子号），开奖号码的百位、十位、个位符合后三组三或者组六均为中奖。',
                                        ball: false
                                    }
                                ],
                                '其他': [
                                    {
                                        name: '和值尾数',
                                        tip: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和的尾数，即为中奖。',
                                        ball:
                                            {
                                                '尾数': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '豹子',
                                        tip: '开奖号码百位、十位、个位：111,222,999等，只要前三位号码一致即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['豹子']
                                            }

                                    },
                                    {
                                        name: '顺子',
                                        tip: '开奖号码百位、十位、个位：123,213,321等（顺序不限），即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['顺子']
                                            }

                                    },
                                    {
                                        name: '对子',
                                        tip: '开奖号码百位、十位、个位：110，101,011等，只要百位、十位、个位号码中任意两个数字相同即为中奖。',
                                        ball:
                                            {
                                                '特殊号': ['对子']
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '二星',
                            playType: {
                                '直选': [
                                    {
                                        name: '前二复式',
                                        tip: '从万位、千位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。',
                                        ball:
                                            {
                                                '万位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '前二单式',
                                        tip: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    },
                                    {
                                        name: '后二复式',
                                        tip: '从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的后2位相同，且顺序一致，即为中奖。',
                                        ball:
                                            {
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '个位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '后二单式',
                                        tip: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，且顺序一致，即为中奖。',
                                        ball: false
                                    }
                                ],
                                '组选': [
                                    {
                                        name: '前二复式',
                                        tip: '从0-9中选2个号码组成一注，所选号码与开奖号码的万位、千位相同，顺序不限（不含对子号），即中奖。',
                                        ball:
                                            {
                                                '前二组选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '前二单式',
                                        tip: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，顺序不限（不含对子号），即为中奖。',
                                        ball: false
                                    },
                                    {
                                        name: '后二复式',
                                        tip: '从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限（不含对子号），即为中奖。',
                                        ball:
                                            {
                                                '后二组选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    },
                                    {
                                        name: '后二单式',
                                        tip: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，顺序不限（不含对子号），即为中奖。',
                                        ball: false
                                    },
                                ]
                            }
                        },
                        {
                            name: '定位胆',
                            playType: {
                                '定位胆': [
                                    {
                                        name: '后二单式',
                                        tip: '从万位、千位、百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。',
                                        ball:
                                            {
                                                '万位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '千位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '百位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '十位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                                '个位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '不定位',
                            playType: {
                                '三星不定位': [
                                    {
                                        name: '前三一码不定位',
                                        tip: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位中包含所选号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '前三二码不定位',
                                        tip: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位中同时包含所选的2个号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '中三一码不定位',
                                        tip: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的千位、百位、十位中包含所选号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '后三一码不定位',
                                        tip: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    }
                                ],
                                '四星不定位': [
                                    {
                                        name: '前四一码不定位',
                                        tip: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位，千位、百位、十位中包含所选号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '前四二码不定位',
                                        tip: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位，千位、百位、十位中同时包含所选的2个号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    }
                                ],
                                '五星不定位': [
                                    {
                                        name: '五星一码不定位',
                                        tip: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位、十位、个位中包含所选号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '五星二码不定位',
                                        tip: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位、十位、个位中同时包含所选的2个号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '五星三码不定位',
                                        tip: '从0-9中选择3个号码，每注由3个不同的号码组成，开奖号码的万位、千位、百位、十位、个位中同时包含所选的3个号码，即为中奖。',
                                        ball:
                                            {
                                                '不定位': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                ]
                            }
                        },
                        {
                            name: '跨度',
                            playType: {
                                '跨度': [
                                    {
                                        name: '前三跨度',
                                        tip: '前三跨度:所选跨度值与开奖号码的前三位数字的最大值和最小值差值相等,即中奖。',
                                        ball:
                                            {
                                                '前三跨度': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '中三跨度',
                                        tip: '中三跨度:所选跨度值与开奖号码的中三位数字的最大值和最小值差值相等,即中奖。',
                                        ball:
                                            {
                                                '中三跨度': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '后三跨度:',
                                        tip: '后三跨度:所选跨度值与开奖号码的后三位数字的最大值和最小值差值相等,即中奖',
                                        ball:
                                            {
                                                '后三跨度': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '前二跨度:',
                                        tip: '前二跨度:所选跨度值与开奖号码的后三位数字的最大值和最小值差值相等,即中奖',
                                        ball:
                                            {
                                                '前二跨度': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    },
                                    {
                                        name: '后二跨度:',
                                        tip: '后二跨度:所选跨度值与开奖号码的后三位数字的最大值和最小值差值相等,即中奖',
                                        ball:
                                            {
                                                '后二跨度': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '和值',
                            playType: {
                                '直选': [
                                    {
                                        name: '前三',
                                        tip: '所选数值等于开奖号码的万位、千位、百位三个数字相加之和，即为中奖。',
                                        ball:
                                            {
                                                '前三直选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '中三',
                                        tip: '所选数值等于开奖号码的千位、百位、十位三个数字相加之和，即为中奖。',
                                        ball:
                                            {
                                                '中三直选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '后三',
                                        tip: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。',
                                        ball:
                                            {
                                                '后三直选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '前二',
                                        tip: '所选数值等于开奖号码的万位、千位二个数字相加之和，即为中奖。',
                                        ball:
                                            {
                                                '前二直选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '后二',
                                        tip: '所选数值等于开奖号码的十位、个位二个数字相加之和，即为中奖',
                                        ball:
                                            {
                                                '后二直选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    }
                                ],
                                '组选': [
                                    {
                                        name: '前三',
                                        tip: '所选数值等于开奖号码万位、千位、百位三个数字相加之和(非豹子号)，即为中奖。',
                                        ball:
                                            {
                                                '前三组选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '中三',
                                        tip: '所选数值等于开奖号码千位、百位、十位三个数字相加之和(非豹子号)，即为中奖。',
                                        ball:
                                            {
                                                '中三组选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '后三',
                                        tip: '所选数值等于开奖号码百位、十位、个位三个数字相加之和(非豹子号)，即为中奖。',
                                        ball:
                                            {
                                                '后三组选': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    }
                                ],
                                '尾数': [
                                    {
                                        name: '前三',
                                        tip: '所选数值等于开奖号码的万位，千位，百位三个数字相加之和的尾数，即为中奖。',
                                        ball:
                                            {
                                                '前三尾数': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '中三',
                                        tip: '所选数值等于开奖号码的千位，百位，十位三个数字相加之和的尾数，即为中奖。',
                                        ball:
                                            {
                                                '中三尾数': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    },
                                    {
                                        name: '后三',
                                        tip: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和的尾数，即为中奖。',
                                        ball:
                                            {
                                                '后三尾数': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27]
                                            }

                                    }
                                ]
                            }
                        },
                        {
                            name: '龙虎',
                            playType: {
                                '龙虎和': [
                                    {
                                        name: '万千',
                                        tip: '第一球号码大于第二球号码则为龙，第一球号码小于第二球号码则为虎，第一球号码与第二球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '万百',
                                        tip: '第一球号码大于第三球号码则为龙，第一球号码小于第三球号码则为虎，第一球号码与第三球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '万十',
                                        tip: '第一球号码大于第四球号码则为龙，第一球号码小于第四球号码则为虎，第一球号码与第四球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '万个',
                                        tip: '第一球号码大于第五球号码则为龙，第一球号码小于第五球号码则为虎，第一球号码与第五球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '千百',
                                        tip: '第二球号码大于第三球号码则为龙，第二球号码小于第三球号码则为虎，第二球号码与第三球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '千十',
                                        tip: '第二球号码大于第四球号码则为龙，第二球号码小于第四球号码则为虎，第二球号码与第四球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '千个',
                                        tip: '第二球号码大于第五球号码则为龙，第二球号码小于第五球号码则为虎，第二球号码与第五球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '百十',
                                        tip: '第三球号码大于第四球号码则为龙，第三球号码小于第四球号码则为虎，第三球号码与第四球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '百个',
                                        tip: '第三球号码大于第五球号码则为龙，第三球号码小于第五球号码则为虎，第三球号码与第五球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    },
                                    {
                                        name: '十个',
                                        tip: '第四球号码大于第五球号码则为龙，第四球号码小于第五球号码则为虎，第四球号码与第五球号码相等则为和',
                                        ball:
                                            {
                                                '龙虎': ['龙', '虎', '和']
                                            }

                                    }
                                ]
                            }

                        }
                    ]
                },
            ]
        }
    }
}